F1-Study/baseline/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (30 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (30 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (30 0 0);
    }
    ground
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }
    "side.*"
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    ahmed
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
